In [2]:
import pandas as pd
from mini_project2 import create_connection, ex1, ex2, ex3

DB_PATH = "normalized.db"

conn = create_connection(DB_PATH)
conn

In [3]:
tables = pd.read_sql_query(
    "SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;",
    conn
)
tables

              name
0          Country
1         Customer
2      OrderDetail
3          Product
4  ProductCategory
5           Region

In [4]:
sql = ex3(conn)
print(sql)

df = pd.read_sql_query(sql, conn)
df.head()

    SELECT c.FirstName || ' ' || c.LastName AS Name,
    ROUND(SUM(p.ProductUnitPrice * od.QuantityOrdered), 2) AS Total
    From OrderDetail od
    JOIN Customer c ON od.CustomerID = c.CustomerID
    JOIN Product p ON od.ProductID = p.ProductID
    GROUP BY c.CustomerID, c.FirstName, c.LastName
    ORDER BY Total DESC

                 Name       Total
0      Annette Roulet  6092806.79
1      Manuel Pereira  5905784.45
2      Janete Limeira  5817785.32
3  Christina Berglund  5679042.68
4           Liz Nixon  5623333.51

In [5]:
# Grab a few customer names to choose from:
customers = pd.read_sql_query(
    "SELECT FirstName || ' ' || LastName AS Name FROM Customer ORDER BY Name LIMIT 20;",
    conn
)
customers.head()

                Name
0   Alejandra Camino
1    Alexander Feuer
2       Ana Trujillo
3  Anabela Domingues
4      Andre Fonseca